import './styles/main.pcss';
import Vue from 'vue';

if (process.env.NODE_ENV === 'development') {
  require('file-loader!./index.pug');
}

import './scripts/header';
import './scripts/inputs';

// Parallax
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
import Parallax from './scripts/Parallax';

// создаем и тут же инициализируем параллакс
new Parallax({
  // имя параллакс класса, идентификатра или тега.
  // в случае класса или идентификатор, в начале имени нужно указывать точку или решотку соответственно.
  el: '.parallax--mountains',
  // Стартовая позиция праллакса от 0 до 100
  // 0 - это когда параллак блок только появился при прокрутке,
  // а 100 - когда параллакс блок достик верхней границы окна браузера
  startAt: 100,
  // Винишная позиция паралакса от 0 до 100
  // 0 - это когда параллак блок прекращает работы достигнув верхней границей верхнюю границу окна
  // а 100 - это когда параллакс блок прекращает работы достигнув нижней границей верхнюю границу окна
  stopAt: 100
}).init();

new Parallax({
  el: '.parallax--buddha',
  startAt: 30,
  stopAt: 100
}).init();

// Menu
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
import Menu from './components/menu/menu';

new Vue({
  el: '.header__menu',
  components: {
    vcMenu: Menu
  }
});

new Vue({
  el: '.footer__navigation',
  components: {
    vcMenu: Menu
  }
});


